#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.dataset will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "example_bigquery_dev"
      + delete_contents_on_destroy = false
      + description                = "This is just a example description"
      + etag                       = (known after apply)
      + friendly_name              = "Example BigQuery Dataset"
      + id                         = (known after apply)
      + labels                     = {
          + "created-by"   = "fredrick-myrvoll"
          + "created-on"   = "2019-12-09"
          + "created-with" = "terraform"
          + "environment"  = "dev"
        }
      + last_modified_time         = (known after apply)
      + location                   = "europe-north1"
      + project                    = (known after apply)
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_bigquery_table.table[0] will be created
  + resource "google_bigquery_table" "table" {
      + creation_time       = (known after apply)
      + dataset_id          = "example_bigquery_dev"
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "created-by"   = "fredrick-myrvoll"
          + "created-on"   = "2019-12-09"
          + "created-with" = "terraform"
          + "environment"  = "dev"
        }
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = (known after apply)
      + schema              = jsonencode(
            [
              + {
                  + description = "UUID"
                  + mode        = "NULLABLE"
                  + name        = "id"
                  + type        = "STRING"
                },
              + {
                  + description = "This is just a table containing example strings"
                  + mode        = "NULLABLE"
                  + name        = "example_strings"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "example_table"
      + type                = (known after apply)

      + time_partitioning {
          + require_partition_filter = false
          + type                     = "DAY"
        }
    }

  # google_project_service.bigquery will be created
  + resource "google_project_service" "bigquery" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "module-dev"
      + service                    = "bigquery.googleapis.com"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
